Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure/terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/nyc-landmarks-vector-db/nyc-landmarks-vector-db/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/nyc-landmarks-vector-db/nyc-landmarks-vector-db

To view this run in a browser, visit:
https://app.terraform.io/app/nyc-landmarks/nyc-landmarks-vector-db/runs/run-W3hJhnST4gAn82et

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
google_logging_project_bucket_config.api_logs_bucket: Refreshing state... [id=projects/velvety-byway-327718/locations/global/buckets/api-logs]
google_logging_project_bucket_config.vectordb_logs_bucket: Refreshing state... [id=projects/velvety-byway-327718/locations/global/buckets/vectordb-logs]
google_logging_metric.vectordb_slow_operations: Refreshing state... [id=nyc-landmarks-vector-db.vectordb_slow_operations]
google_logging_metric.vectordb_errors: Refreshing state... [id=nyc-landmarks-vector-db.vectordb_errors]
google_logging_metric.errors: Refreshing state... [id=nyc-landmarks-vector-db.errors]
google_logging_metric.latency: Refreshing state... [id=nyc-landmarks-vector-db.latency]
google_logging_metric.vectordb_logs: Refreshing state... [id=nyc-landmarks-vector-db.vectordb_logs]
google_cloud_scheduler_job.scheduler_health_check: Refreshing state... [id=projects/velvety-byway-327718/locations/us-central1/jobs/nyc-landmarks-health-check]
google_logging_metric.validation_warnings: Refreshing state... [id=nyc-landmarks-vector-db.validation_warnings]
google_monitoring_uptime_check_config.health_check: Refreshing state... [id=projects/velvety-byway-327718/uptimeCheckConfigs/nyc-landmarks-vector-db-health-check-rDNkL5zupws]
google_logging_metric.requests: Refreshing state... [id=nyc-landmarks-vector-db.requests]
google_monitoring_dashboard.api_dashboard: Refreshing state... [id=projects/1052843754581/dashboards/cbcd77e4-0a7a-4bdb-8570-d1adfc28658a]
google_monitoring_alert_policy.vectordb_activity_alert: Refreshing state... [id=projects/velvety-byway-327718/alertPolicies/15343916069992722197]
google_monitoring_alert_policy.vectordb_slow_operations_alert: Refreshing state... [id=projects/velvety-byway-327718/alertPolicies/16573989850872248382]
google_monitoring_alert_policy.vectordb_error_alert: Refreshing state... [id=projects/velvety-byway-327718/alertPolicies/680246190038586123]
google_logging_log_view.vectordb_logs_view: Refreshing state... [id=projects/velvety-byway-327718/locations/global/buckets/vectordb-logs/views/vectordb-logs-view]
google_logging_project_sink.vectordb_logs_sink: Refreshing state... [id=projects/velvety-byway-327718/sinks/vectordb-logs-sink]
google_logging_log_view.api_logs_view: Refreshing state... [id=projects/velvety-byway-327718/locations/global/buckets/api-logs/views/api-logs-view]
google_logging_project_sink.api_logs_sink: Refreshing state... [id=projects/velvety-byway-327718/sinks/api-logs-sink]
google_logging_project_sink.vectordb_logs_sink: Drift detected (delete)
google_monitoring_alert_policy.vectordb_error_alert: Drift detected (update)
google_monitoring_uptime_check_config.health_check: Drift detected (update)
google_monitoring_alert_policy.vectordb_slow_operations_alert: Drift detected (update)
google_monitoring_alert_policy.vectordb_activity_alert: Drift detected (update)
google_logging_project_sink.api_logs_sink: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_logging_project_sink.api_logs_sink has been deleted
  - resource "google_logging_project_sink" "api_logs_sink" {
      - id                     = "projects/velvety-byway-327718/sinks/api-logs-sink" -> null
        name                   = "api-logs-sink"
        # (3 unchanged attributes hidden)
    }

  # google_logging_project_sink.vectordb_logs_sink has been deleted
  - resource "google_logging_project_sink" "vectordb_logs_sink" {
      - id                     = "projects/velvety-byway-327718/sinks/vectordb-logs-sink" -> null
        name                   = "vectordb-logs-sink"
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_scheduler_job.scheduler_health_check will be updated in-place
  ~ resource "google_cloud_scheduler_job" "scheduler_health_check" {
        id               = "projects/velvety-byway-327718/locations/us-central1/jobs/nyc-landmarks-health-check"
        name             = "nyc-landmarks-health-check"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ headers     = {
              + "User-Agent" = "GCP-Scheduler-HealthCheck/1.0"
            }
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_logging_log_view.api_chat_logs_view will be created
  + resource "google_logging_log_view" "api_chat_logs_view" {
      + bucket      = "projects/velvety-byway-327718/locations/global/buckets/api-logs"
      + create_time = (known after apply)
      + description = "View for /api/chat endpoint logs"
      + filter      = "jsonPayload.request_path=~\"/api/chat\" OR httpRequest.requestUrl=~\"/api/chat\""
      + id          = (known after apply)
      + location    = (known after apply)
      + name        = "api-chat-logs-view"
      + parent      = (known after apply)
      + update_time = (known after apply)
    }

  # google_logging_log_view.api_health_logs_view will be created
  + resource "google_logging_log_view" "api_health_logs_view" {
      + bucket      = "projects/velvety-byway-327718/locations/global/buckets/api-logs"
      + create_time = (known after apply)
      + description = "View for /api/health endpoint logs"
      + filter      = "jsonPayload.request_path=~\"/api/health\" OR httpRequest.requestUrl=~\"/api/health\" OR jsonPayload.request_path=\"/health\""
      + id          = (known after apply)
      + location    = (known after apply)
      + name        = "api-health-logs-view"
      + parent      = (known after apply)
      + update_time = (known after apply)
    }

  # google_logging_log_view.api_query_logs_view will be created
  + resource "google_logging_log_view" "api_query_logs_view" {
      + bucket      = "projects/velvety-byway-327718/locations/global/buckets/api-logs"
      + create_time = (known after apply)
      + description = "View for /api/query endpoint logs"
      + filter      = "jsonPayload.request_path=~\"/api/query\" OR httpRequest.requestUrl=~\"/api/query\""
      + id          = (known after apply)
      + location    = (known after apply)
      + name        = "api-query-logs-view"
      + parent      = (known after apply)
      + update_time = (known after apply)
    }

  # google_logging_project_sink.api_logs_sink will be created
  + resource "google_logging_project_sink" "api_logs_sink" {
      + destination            = "logging.googleapis.com/projects/velvety-byway-327718/locations/global/buckets/api-logs"
      + filter                 = (sensitive value)
      + id                     = (known after apply)
      + name                   = "api-logs-sink"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options (known after apply)
    }

  # google_logging_project_sink.vectordb_logs_sink will be created
  + resource "google_logging_project_sink" "vectordb_logs_sink" {
      + destination            = "logging.googleapis.com/projects/velvety-byway-327718/locations/global/buckets/vectordb-logs"
      + filter                 = (sensitive value)
      + id                     = (known after apply)
      + name                   = "vectordb-logs-sink"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options (known after apply)
    }

  # google_monitoring_alert_policy.vectordb_activity_alert will be updated in-place
  ~ resource "google_monitoring_alert_policy" "vectordb_activity_alert" {
      ~ display_name          = "Vector Database Inactivity Alert" -> "Vector Database Activity Alert"
        id                    = "projects/velvety-byway-327718/alertPolicies/15343916069992722197"
        name                  = "projects/velvety-byway-327718/alertPolicies/15343916069992722197"
        # (7 unchanged attributes hidden)

      ~ alert_strategy {
          ~ auto_close = "86400s" -> "1800s"
        }

      ~ conditions {
          ~ display_name = "Low or no activity in vector database" -> "Low activity in vector database operations"
            name         = "projects/velvety-byway-327718/alertPolicies/15343916069992722197/conditions/15343916069992721502"

          ~ condition_threshold {
              ~ duration                = "1800s" -> "600s"
              ~ filter                  = "metric.type=\"logging.googleapis.com/user/nyc-landmarks-vector-db.vectordb_logs\" AND resource.type=\"global\"" -> "metric.type=\"logging.googleapis.com/user/landmarks-.vectordb_logs\" AND resource.type=\"global\""
                # (4 unchanged attributes hidden)

              ~ aggregations {
                  ~ alignment_period     = "900s" -> "300s"
                    # (3 unchanged attributes hidden)
                }

              - trigger {
                  - count   = 1 -> null
                  - percent = 0 -> null
                }
            }
        }

      ~ documentation {
          ~ content   = "Vector database shows little to no activity for an extended period. This might indicate the service is not being utilized or is experiencing issues." -> "Vector database is showing abnormally low activity. Check if service is functioning correctly."
            # (2 unchanged attributes hidden)
        }
    }

  # google_monitoring_alert_policy.vectordb_error_alert will be updated in-place
  ~ resource "google_monitoring_alert_policy" "vectordb_error_alert" {
        id                    = "projects/velvety-byway-327718/alertPolicies/680246190038586123"
        name                  = "projects/velvety-byway-327718/alertPolicies/680246190038586123"
        # (8 unchanged attributes hidden)

      ~ conditions {
            name         = "projects/velvety-byway-327718/alertPolicies/680246190038586123/conditions/680246190038587648"
            # (1 unchanged attribute hidden)

          ~ condition_threshold {
              ~ filter                  = "metric.type=\"logging.googleapis.com/user/nyc-landmarks-vector-db.vectordb_errors\" AND resource.type=\"global\"" -> "metric.type=\"logging.googleapis.com/user/landmarks-.vectordb_errors\" AND resource.type=\"global\""
                # (5 unchanged attributes hidden)

              - trigger {
                  - count   = 1 -> null
                  - percent = 0 -> null
                }

                # (1 unchanged block hidden)
            }
        }

      ~ documentation {
          ~ content   = "Vector database operations are experiencing errors at a rate higher than normal. Please investigate logs in the vectordb-logs bucket for more details." -> "Vector database is experiencing high error rates. Check logs for details."
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_monitoring_alert_policy.vectordb_slow_operations_alert will be updated in-place
  ~ resource "google_monitoring_alert_policy" "vectordb_slow_operations_alert" {
        id                    = "projects/velvety-byway-327718/alertPolicies/16573989850872248382"
        name                  = "projects/velvety-byway-327718/alertPolicies/16573989850872248382"
        # (8 unchanged attributes hidden)

      ~ conditions {
          ~ display_name = "High number of slow vector database operations" -> "High rate of slow operations in vector database"
            name         = "projects/velvety-byway-327718/alertPolicies/16573989850872248382/conditions/16573989850872249567"

          ~ condition_threshold {
              ~ filter                  = "metric.type=\"logging.googleapis.com/user/nyc-landmarks-vector-db.vectordb_slow_operations\" AND resource.type=\"global\"" -> "metric.type=\"logging.googleapis.com/user/landmarks-.vectordb_slow_operations\" AND resource.type=\"global\""
              ~ threshold_value         = 10 -> 5
                # (4 unchanged attributes hidden)

              - trigger {
                  - count   = 1 -> null
                  - percent = 0 -> null
                }

                # (1 unchanged block hidden)
            }
        }

      ~ documentation {
          ~ content   = "Vector database is experiencing a high number of slow operations (>500ms). This may indicate performance issues or resource constraints." -> "Vector database is experiencing slow operations. Check system resources and vector database logs."
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_monitoring_dashboard.api_dashboard will be updated in-place
  ~ resource "google_monitoring_dashboard" "api_dashboard" {
      ~ dashboard_json = (sensitive value)
        id             = "projects/1052843754581/dashboards/cbcd77e4-0a7a-4bdb-8570-d1adfc28658a"
        # (1 unchanged attribute hidden)
    }

  # google_project_iam_member.api_logs_sink_writer will be created
  + resource "google_project_iam_member" "api_logs_sink_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (sensitive value)
      + role    = "roles/logging.bucketWriter"
    }

  # google_project_iam_member.vectordb_logs_sink_writer will be created
  + resource "google_project_iam_member" "vectordb_logs_sink_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (sensitive value)
      + role    = "roles/logging.bucketWriter"
    }

Plan: 7 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  + log_sinks            = {
      + api_logs_sink      = (known after apply)
      + vectordb_logs_sink = (known after apply)
    }
  ~ log_views            = {
      + api_chat_logs_view   = "api-chat-logs-view"
      + api_health_logs_view = "api-health-logs-view"
      + api_query_logs_view  = "api-query-logs-view"
        # (2 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request Comment -->